# Задача 1. Напишете програма, която намира произведението на числата от m до n (където n и m са въведени от потребителя), които се делят на 3 и 4. Принтирайте резултата на конзолата.

import sys
m = int(input("Въведете m: "))
n = int(input("Въведете n: "))

pr = 1

for i in range(m, n + 1):
    if i % 3 == 0 or i % 4 == 0:
        pr *= i

    print("Произведението е:", pr)


# Задача 2. Напишете програма, която намира средноаритметичното на числата, които се делят на 3 в интервала от 7 до 70

sum = 0
count = 0

for i in range(7, 71):
    if i % 3 == 0:
        sum += i
        count += 1
        avg = sum/count
print("Средноаритметичното на числата е:", count)

# Задача 3. Напишете програма, която по въведено от потребителя число определя: Цифрата на единиците дели ли се на 5, а цифрата на десетиците четно число ли е.

m = int(input("Въведете число: "))
ed = m//10
des = m % 10
if ed % 5 == 0:
    print("Цифрата на единиците се дели на 5")
else:
    print("Цифрата на единиците не се дели на 5")

if des % 2 == 0:
    print("Цифрата на десетиците е четна")
else:
    print("Цифрата на десетиците е нечетна")

# Задача 4. Напишете програма, която намира сумата на числата от 1 до 50, които се делят на 2 или 3, но не се делят едновременно на 2 и 3. Принтирайте резултата.

sum = 0
for i in range(1, 51):
    if (i % 2 == 0 or i % 3 == 0) and not (i % 2 == 0 and i % 3 == 0):
        sum += i

print("Сумата на числата от 1 до 50, които се делят на 2 или 3, но не се делят едновременно на 2 и 3 е: ", sum)

# Задача 5. Напишете програма, в която потребителя въвежда цяло число n, след това въвежда n на брой числа и намира числото с минимална стойност и числото с максимална стойност.

n = int(input("Въведете брой числа: "))
min_num = sys.maxsize
max_num = -sys.maxsize

for i in range(1, n + 1):
    num = int(input(f"Въведете число {i}: "))
    if num < min_num:
        min_num = num
    if num > max_num:
        max_num = num


print("Минималното число е:", min_num)
print("Максималното число е:", max_num)

# Задача 6. Програма, изчисляваща лице и обиколка на геометрична фигура, като първо се избира вида на фигурата след което въвеждате страните на фигурите.

fig = input("Въведи tr,kv,pr: ")
match fig:
    case "tr":
        a = int(input("Страна а е:"))
        b = int(input("Страна b е:"))
        c = int(input("Страна c е:"))
        print(f"Лицето на триъгълника е {(a*b)/2}, а периметърът е {a+b+c}")
    case "kv":
        a = int(input("Страна а е:"))
        print(f"Лицето на квадрата е {a**2}, а периметърът е {4*a}")
    case "pr":
        a = int(input("Страна а е:"))
        b = int(input("Страна b е:"))
        print(f"Лицето на правоъгълника е {a*b}, а периметърът е {(a+b)*2}")

# Задача 7. Програма, изчисляваща стипендия на студенти.

usp = float(input("Въведи успех: "))
st = int(input("Максималната стипендия е: "))

if usp >= 5.50:
    print(f"Получаваш максималната стипендия равна на {st} лв")
elif usp >= 5 and usp < 5.50:
    print(
        f"Получаваш 70 процента от максималната стипендия равна на {(70/100)*st} лв")
elif usp >= 4.50 and usp < 5:
    print(
        f"Получаваш 50 процента от максималната стипендия равна на {(50/100)*st} лв")
elif usp < 4.50:
    print(f"Не получаваш стипендия")
