
# Зад 1. От лист да принтираме обратен ред, всичко без последния елемент, всичко без първия, първите два, последните двa
list = [1, 2, 3, 4, 5, 6, 7]
print("Обратен ред:", list[::-1])
print("Без последния елемент:", list[:-1])
print("Без първия елемент:", list[1:])
print("Първите два елемента:", list[:2])
print("Последните два елемента:", list[-2:])

# Зад 2. Програма, в която потребителя въвежда цяло число, а програмата координира два кортежа, състоящи се от цифрите в това число. Единият с цифрите на числото в прав ред и вторият, в който са в обратен ред.
n = int(input("Въведи цели числа: "))

result = []

for num in range(1, n + 1):
    result.append(num)

order_tuple = tuple(result)
reversed_tuple = tuple(result[::-1])

print(order_tuple)
print(reversed_tuple)

# Зад 3. Програма, в която се създава числов списък със случайни числа след това между всяка двойка елементи от този списък се вмъква нов елемент равен на сумата от стойностите на съседните елементи, като ограничаваме броя на числата чрез терминала

import random
n = int(input("Брой на елементите в списъка: "))
i = 1
list = [random.randint(1, 100) for i in range(n)]
print("Списък:", list)
while i < len(list):
    sums = list[i - 1] + list[i]
    list.insert(i, sums)
    i += 2
print("Списък след вмъкване на суми:", list)

# Зад 4. Програма, в която потребителя въвежда текст и на негова беза се създава речник, за ключове на речника служат символите от текста, а стойността на елементите се определя от съответните символи в текстa

text = input("Въведи текст: ")
dict = {}
for char in text:
    if char in dict:
        dict[char] += 1
    else:
        dict[char] = 1
print("Речник:", dict)

# Зад 5. Напишете програма, в която потребителя въвежда чяло число. От него се създава списък състоящ се от числата от 1 до това число . Въз основа на този списък се създава речник, в който елементите на списъка служат за ключове на елементите на речника , а стойностите на тези елементи в речника са елементите на списъка но в обратен ред. Пример : ако сме въвели числото 4 , създава се списъка [1,2,3,4 ] и на негова основа се създава речник с 4 елемента : {1:4, 2:3, 3:2, 4:1}

n = int(input("Въведи цяло число: "))
list = [i for i in range(1, n + 1)]
reversed_list = list[::-1]
dict = {}
for i in range(len(list)):
    dict[list[i]] = reversed_list[i]
print("Речник:", dict)


