import math
print([5]*3)  # Повтаря елемента 3 пъти в един списък
print('e' in 'hello')  # Връща True или False, ako елементът е в списъка

name = input('My name:')
age = input('My age is:')
print('Hello my name is', name, 'and i am', age, 'years old')

x1 = float(input('x1: '))
x2 = float(input('x2: '))
sum = x1 + x2
print = ('Сумата е:', sum)

# Задача 1 - Програма която чете от програмата три числа и пресмята лицето на трапец с основа a и b и височина h. Принтирайте резултата на екрана като го закръглите до втория знак след десетичната запетая.

a = float(input('a='))
b = float(input('b='))
h = float(input('h='))
s = (a+b)*h/2
print(f'Лицето на трапеца е равно на {s:.2f}')

# Задача 2 - Напишете програма, която чете от конзолата число r и пресмята лицето и периметъра на окръжност с радиус r. Принтирайте резултата на екрана като го закръглите до трети знак след десетичната запетая.

r = float(input('r='))
s = math.pi*r**2
p = math.pi*r*2
print(
    f'Лицето на окръжността е равно на {s:.3f}, а периметърът е равен на {p:.3f}')

# Задача 3 - Напишете програма, която да подкани потребителя да въведе броя на часовете и тарифата на час. Да се изчисли брутното заплащане.

hours = float(input('Въведете боря на часове работени през деня: '))
tariff = float(input('Въведете тарифата на час:'))
salary = hours * tariff
print(f'Брутното заплащане е: {salary} лв.')

# Задача 4 - Трябва да въведем от конзолата число еквивалентно на брой минутии да се изведе на екрана колко дни, часа и минути са това.

minutes = int(input('Въведете брой минути: '))
hours = minutes // 60
mins = minutes % 60
days = hours // 24
print(f'{minutes} минути са {days} дни {hours} часа и {mins} минути.')

# Задача 5 - Напишете програма, която чете от конзолата число n и проверява дали е четно или нечетно.abs

n = int(input('n = '))
if n % 2 == 0:
    print(f'Числото {n} е четно')
else:
    print(f'Числото {n} е нечетно')

# Задача 6 - Напишете програма, която смята средно аритметично на три числа въведен и от конзолата.

a = float(input('a = '))
b = float(input('b = '))
c = float(input('c = '))
print(f'Средно аритметично на {a}, {b} и {c} е {(a+b+c)/3}')
