# Задача 1. Програма, която въвежда дадена възраст и да проверим дали е непълнолетен, пълнолетен или пенсионер

import sys
age = int(input("Моята възраст е: "))
if age < 18:
    print(f"Ти си на {age}, тоест не си пълнолетен")
elif age > 18 & age < 65:
    print(f"Ти си на {age}, тоест си пълнолетен")
else:
    print(f"Ти си на {age}, тоест си пенсионер")

# Задача 2. Програма, която отпечатва от 1 до 20, пропуска 5 и спира на 11.

for i in range(1, 21):
    if i == 5:
        continue
    if i == 11:
        break
print(i)

# Задача 3. Програма, която въвежда n цели числа и намира най - голямото между тях.


n = int(input("Въведете брой числа: "))
max = -sys.maxsize

for i in range(1, n+1):
    number = int(input(f"Въведете число номер {i}: "))
    if number > max:
        max = number
print(f"Най - голямото число от тези {n} на брой числа е {max}.")

# Задача 4. Да напишем прогарма, която въвежда n цели числа и ги сумира

n = int(input("Въведете колко на брой цели числа искате да въведете: "))
sum = 0

for i in range(1, n+1):
    num = int(input(f"Въведете число номер {i}: "))
    sum += num
print(f"Сборът на тези {n} числа е {sum}")

# Задача 5. Програма, която брои колко числа от едно до сто са кратни и на 3 и на 5

count = 0

for i in range(1, 101):
    if i % 3 == 0 and i % 5 == 0:
        count += 1
print(f"{count} на брой числа от 1 до 100 са кратни на 3 и 5")

# Задача 6. Програма, която извежда таблица за умножение за числата от едно до 10. За всяко число i от 1 до 10, програмата трябва да изведе умножението на i с 1 до 10, като i трябва да се отпечатва на нов ред с - -------

for i in range(1, 11):
    for n in range(1, 11):
        print(f"{i} x {n} = {i*n}")
    print("----------")

# Задача 7. Програма, която въвежда стринг, който да има главни и малки букви и да отпечатваме отделно главните и малките

str = input("Въведи дума с главни и малки букви: ")
upper = ""
lower = ""

for i in str:
    if i.isupper():
        upper += i
    else:
        lower += i
print(f"Главни букви: {upper}")
print(f"Малки букви: {lower}")

# Задача 8. Програма която въвежда число n и печата равнобедрен, като върхът му е най - горе и основата му най долу и центриран, само контуриран триъгълник от звездички

n = int(input("Въведете височината на триъгълника: "))

for i in range(n):
    print(" " * (n - i - 1), end="")

    if i == 0:
        print("*")
    elif i == n - 1:
        print("*" * (2 * i + 1))
    else:
        print("*" + " " * (2 * i - 1) + "*")
